swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.c
/***************************************************************************//**
* \file CapSense_1_Sensing.c
* \version 3.0
*
* \brief
*   This file contains the source of functions common for
*   different sensing methods.
*
* \see CapSense_1 v3.0 Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#include <stdlib.h>
#include "cyfitter.h"
#include "gpio/cy_gpio.h"
#include "cyfitter_sysint_cfg.h"
#include "CapSense_1_ModClk.h"
#include "CapSense_1_Configuration.h"
#include "CapSense_1_Structure.h"
#include "CapSense_1_Sensing.h"
#if (CapSense_1_ENABLE == CapSense_1_CSX_EN)
    #include "CapSense_1_SensingCSX_LL.h"
#endif /* (CapSense_1_ENABLE == CapSense_1_CSX_EN) */
#if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
    #include "CapSense_1_SensingCSD_LL.h"
#endif /* (CapSense_1_ENABLE == CapSense_1_CSD_EN) */
#if (CapSense_1_CSD_SS_DIS != CapSense_1_CSD_AUTOTUNE)
    #include "CapSense_1_SmartSense_LL.h"
#endif  /* (CapSense_1_CSD_SS_DIS != CapSense_1_CSD_AUTOTUNE) */
#if (CapSense_1_ENABLE == CapSense_1_ADC_EN)
    #include "CapSense_1_Adc.h"
#endif /* (CapSense_1_ENABLE == CapSense_1_ADC_EN) */
#if (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN)
    #include "CapSense_1_SelfTest.h"
#endif
#include "cyapicallbacks.h"


/***************************************
* API Constants
***************************************/

#define CapSense_1_CALIBRATION_RESOLUTION                 (12u)
#define CapSense_1_CALIBRATION_FREQ_KHZ                   (1500u)
#define CapSense_1_CSD_AUTOTUNE_CAL_LEVEL                 (CapSense_1_CSD_RAWCOUNT_CAL_LEVEL)
#define CapSense_1_CSD_AUTOTUNE_CAL_UNITS                 (1000u)
#define CapSense_1_CP_MIN                                 (0u)
#define CapSense_1_CP_MAX                                 (65000Lu)
#define CapSense_1_CP_ERROR                               (4000Lu)
#define CapSense_1_CLK_SOURCE_LFSR_SCALE_OFFSET           (4u)
#define CapSense_1_CSD_SNS_FREQ_KHZ_MAX                   (6000u)

#define CapSense_1_MOD_CSD_CLK_12000KHZ                   (12000uL)
#define CapSense_1_MOD_CSD_CLK_24000KHZ                   (24000uL)
#define CapSense_1_MOD_CSD_CLK_48000KHZ                   (48000uL)

#define CapSense_1_EXT_CAP_DISCHARGE_TIME                 (1u)

/*****************************************************************************/
/* Enumeration types definition                                              */
/*****************************************************************************/

typedef enum
{
    CapSense_1_RES_PULLUP_E   = 0x02u,
    CapSense_1_RES_PULLDOWN_E = 0x03u
} CapSense_1_PORT_TEST_DM;

typedef enum
{
    CapSense_1_STS_RESET      = 0x01u,
    CapSense_1_STS_NO_RESET   = 0x02u
} CapSense_1_TEST_TYPE;


/*******************************************************************************
* Static Function Prototypes
*******************************************************************************/
/**
* \cond SECTION_CYSENSE_INTERNAL
* \addtogroup group_cysense_internal
* \{
*/

#if ((CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) || \
     (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN) || \
     (CapSense_1_ENABLE == CapSense_1_ADC_EN))
    #if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
        static void CapSense_1_SsCSDDisableMode(void);
    #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_EN) */
    #if (CapSense_1_ENABLE == CapSense_1_CSX_EN)
        static void CapSense_1_SsDisableCSXMode(void);
    #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_EN) */
#endif

#if(((CapSense_1_ENABLE == CapSense_1_CSX_EN) && \
     (CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSX_TX_CLK_SOURCE) && \
     (CapSense_1_DISABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)) ||\
    ((CapSense_1_ENABLE == CapSense_1_CSD_EN) && \
     (CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSD_SNS_CLK_SOURCE)))
    static uint8 CapSense_1_SsCalcLfsrSize(uint32 snsClkDivider, uint32 conversionsNum);
    static uint8 CapSense_1_SsCalcLfsrScale(uint32 snsClkDivider, uint8 lfsrSize);
#endif

#if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
    static void CapSense_1_SsSetWidgetSenseClkSrc(uint32 wdgtIndex, CapSense_1_RAM_WD_BASE_STRUCT * ptrWdgt);
#endif

#if (CapSense_1_ENABLE == CapSense_1_CSX_EN)
    __STATIC_INLINE void CapSense_1_SsSetWidgetTxClkSrc(uint32 wdgtIndex, CapSense_1_RAM_WD_BASE_STRUCT * ptrWdgt);
#endif

/** \}
* \endcond */

