swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.c
/*******************************************************************************
* Defines module variables
*******************************************************************************/

#if ((CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) || \
     (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN) || \
     (CapSense_1_ENABLE == CapSense_1_ADC_EN))
    CapSense_1_SENSE_METHOD_ENUM CapSense_1_currentSenseMethod = CapSense_1_UNDEFINED_E;
#endif

#if(CapSense_1_ENABLE == CapSense_1_MULTI_FREQ_SCAN_EN)
    /* Module variable keep track of multi-frequency scan channel index */
    uint8 CapSense_1_scanFreqIndex = 0u;
#else
    /* const allows C-compiler to do optimization */
    const uint8 CapSense_1_scanFreqIndex = 0u;
#endif

/* Global software variables */
volatile uint8 CapSense_1_widgetIndex = 0u;    /* Index of the scanning widget */
volatile uint8 CapSense_1_sensorIndex = 0u;    /* Index of the scanning sensor */
uint8 CapSense_1_requestScanAllWidget = 0u;

/* Pointer to RAM_SNS_STRUCT structure */
CapSense_1_RAM_SNS_STRUCT *CapSense_1_curRamSnsPtr;

#if ((CapSense_1_ENABLE == CapSense_1_CSD_GANGED_SNS_EN) || \
     (CapSense_1_ENABLE == CapSense_1_CSX_EN))
    /* Pointer to Flash structure holding configuration of widget to be scanned */
    CapSense_1_FLASH_WD_STRUCT const *CapSense_1_curFlashWdgtPtr = 0u;
#endif

#if (CapSense_1_ENABLE == CapSense_1_CSD_GANGED_SNS_EN)
    /* Pointer to Flash structure holding info of sensor to be scanned */
    CapSense_1_FLASH_SNS_STRUCT const *CapSense_1_curFlashSnsPtr = 0u;
#endif

/* Pointer to Flash structure to hold Sns electrode that was connected previously */
CapSense_1_FLASH_IO_STRUCT const *CapSense_1_curSnsIOPtr;


/*******************************************************************************
* Function Name: CapSense_1_IsBusy
****************************************************************************//**
*
* \brief
*  Returns the current status of the Component (Scan is completed or Scan is in
*  progress).
*
* \details
*  This function returns a status of the hardware block whether a scan is
*  currently in progress or not. If the Component is busy, no new scan or setup
*  widgets is made. The critical section (i.e. disable global interrupt)
*  is recommended for the application when the device transitions from
*  the active mode to sleep or deep sleep modes.
*
* \return
*  Returns the current status of the Component:
*    - CapSense_1_NOT_BUSY - No scan is in progress and a next scan
*      can be initiated.
*    - CapSense_1_SW_STS_BUSY - The previous scanning is not completed
*      and the hardware block is busy.
*
*******************************************************************************/
uint32 CapSense_1_IsBusy(void)
{
    return (CapSense_1_dsRam.status & CapSense_1_SW_STS_BUSY);
}


/*******************************************************************************
* Function Name: CapSense_1_SetBusyFlags
****************************************************************************//**
*
* Sets the BUSY flags of the CapSense_1_dsRam.status register specified
* by the flags parameter.
*
* This is an internal function. Do not call this function directly from
* the application layer.
*
* \param flags
*  Specifies the bit-mask of flags to be set. The bit-mask can be constructed
*  from the following flags:
*   - CapSense_1_SW_STS_BUSY
*   - CapSense_1_WDGT_SW_STS_BUSY
*
*******************************************************************************/
void CapSense_1_SetBusyFlags(uint32 flags)
{
    flags &= (CapSense_1_SW_STS_BUSY | CapSense_1_WDGT_SW_STS_BUSY);
    CapSense_1_dsRam.status |= flags;
}


/*******************************************************************************
* Function Name: CapSense_1_ClrBusyFlags
****************************************************************************//**
*
* Clears the BUSY flags of the CapSense_1_dsRam.status register specified
* by the flags parameter.
*
* This is an internal function. Do not call this function directly from
* the application layer.
*
* \param flags
*  Specifies the bit-mask of flags to be cleared. The bit-mask can be constructed
*  from the following flags:
*   - CapSense_1_SW_STS_BUSY
*   - CapSense_1_WDGT_SW_STS_BUSY
*
*******************************************************************************/
void CapSense_1_ClrBusyFlags(uint32 flags)
{
    /* Clear busy flag */
    flags &= (CapSense_1_SW_STS_BUSY | CapSense_1_WDGT_SW_STS_BUSY);
    CapSense_1_dsRam.status &= (~flags);

    #ifdef CapSense_1_END_OF_SCAN_CALLBACK
        if(0uL == (flags & CapSense_1_SW_STS_BUSY))
        {
            CapSense_1_EndOfScanCallback(CapSense_1_widgetIndex, CapSense_1_sensorIndex);
        }
    #endif /* CapSense_1_END_OF_SCAN_CALLBACK */
}


/*******************************************************************************
* Function Name: CapSense_1_SetupWidget
****************************************************************************//**
*
* \brief
*  Performs the initialization required to scan the specified widget.
*
* \details
*  This function prepares the Component to scan all the sensors in the specified
*  widget by executing the following tasks:
*    1. Re-initialize the hardware if it is not configured to perform the
*       sensing method used by the specified widget, this happens only if the
*       CSD and CSX methods are used in the Component.
*    2. Initialize the hardware with specific sensing configuration (e.g.
*       sensor clock, scan resolution) used by the widget.
*    3. Disconnect all previously connected electrodes, if the electrodes
*       connected by the CapSense_1_CSDSetupWidgetExt(),
*       CapSense_1_CSXSetupWidgetExt() or CapSense_1_CSDConnectSns()
*       functions and not disconnected.
*
*  This function does not start sensor scanning, the CapSense_1_Scan()
*  function must be called to start the scan sensors in the widget. If this
*  function is called more than once, it does not break the Component operation,
*  but only the last initialized widget is in effect.
*
* \param widgetId
*  Specifies the ID number of the widget to be initialized for scanning.
*  A macro for the widget ID can be found in the
*  CapSense_1 Configuration header file defined as
*  CapSense_1_<WidgetName>_WDGT_ID.
*
* \return
*  Returns the status of the widget setting up operation:
*    - CY_RET_SUCCESS - The operation is successfully completed.
*    - CY_RET_BAD_PARAM - The widget is invalid or if the specified widget is
*      disabled
*    - CY_RET_INVALID_STATE - The previous scanning is not completed and the
*      hardware block is busy.
*    - CY_RET_UNKNOWN - An unknown sensing method is used by the widget or any
*      other spurious error occurred.
*
**********************************************************************************/
cy_status CapSense_1_SetupWidget(uint32 widgetId)
{
    cy_status widgetStatus;

    if (CapSense_1_WDGT_SW_STS_BUSY == (CapSense_1_dsRam.status & CapSense_1_WDGT_SW_STS_BUSY))
    {
        /* Previous widget is being scanned. Return error. */
        widgetStatus = CY_RET_INVALID_STATE;
    }
    /*
     *  Check if widget id is valid, specified widget is enabled and widget did not
     *  detect any fault conditions if BIST is enabled. If all conditions are met,
     *  set widgetStatus as good, if not, set widgetStatus as bad.
     */
    else if ((CapSense_1_TOTAL_WIDGETS > widgetId) &&
        (0uL != CapSense_1_GET_WIDGET_EN_STATUS(widgetId)))

    {
        widgetStatus = CY_RET_SUCCESS;
    }
    else
    {
        widgetStatus = CY_RET_BAD_PARAM;
    }

