swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.c
    /*
     * Check widgetStatus flag that is set earlier, if flag is good, then set up only
     * widget
     */
    if (CY_RET_SUCCESS == widgetStatus)
    {
        #if (CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN)
            /* Check widget sensing method is CSX and call CSX APIs */
            if (CapSense_1_SENSE_METHOD_CSX_E ==
                CapSense_1_GET_SENSE_METHOD(&CapSense_1_dsFlash.wdgtArray[widgetId]))
            {
                /* Set up widget for CSX scan */
                CapSense_1_CSXSetupWidget(widgetId);
            }
            /* Check widget sensing method is CSD and call appropriate API */
            else if (CapSense_1_SENSE_METHOD_CSD_E ==
                     CapSense_1_GET_SENSE_METHOD(&CapSense_1_dsFlash.wdgtArray[widgetId]))
            {
                /* Set up widget for CSD scan */
                CapSense_1_CSDSetupWidget(widgetId);
            }
            else
            {
                /* Sensing method is invalid, return error to caller */
                widgetStatus = CY_RET_UNKNOWN;
            }
        #elif (CapSense_1_ENABLE == CapSense_1_CSD_EN)
            /* Set up widget for scan */
            CapSense_1_CSDSetupWidget(widgetId);
        #elif (CapSense_1_ENABLE == CapSense_1_CSX_EN)
            /* Set up widgets for scan */
            CapSense_1_CSXSetupWidget(widgetId);
        #else
            widgetStatus = CY_RET_UNKNOWN;
            #error "No sensing method enabled, Component cannot work in this mode"
        #endif
    }

    return (widgetStatus);
}


/*******************************************************************************
* Function Name: CapSense_1_Scan
****************************************************************************//**
*
* \brief
*  Initiates scanning of all the sensors in the widget initialized by
*  CapSense_1_SetupWidget(), if no scan is in progress.
*
* \details
*  This function is called only after the CapSense_1_SetupWidget()
*  function is called to start the scanning of the sensors in the widget. The
*  status of a sensor scan must be checked using the CapSense_1_IsBusy()
*  API prior to starting a next scan or setting up another widget.
*
* \return
*  Returns the status of the scan initiation operation:
*    - CY_RET_SUCCESS - Scanning is successfully started.
*    - CY_RET_INVALID_STATE - The previous scanning is not completed and the
*      hardware block is busy.
*    - CY_RET_UNKNOWN - An unknown sensing method is used by the widget.
*
********************************************************************************/
cy_status CapSense_1_Scan(void)
{
    cy_status scanStatus = CY_RET_SUCCESS;

    if (CapSense_1_WDGT_SW_STS_BUSY == (CapSense_1_dsRam.status & CapSense_1_WDGT_SW_STS_BUSY))
    {
        /* Previous widget is being scanned. Return error. */
        scanStatus = CY_RET_INVALID_STATE;
    }
    else
    {
        /* If both CSD and CSX are enabled, call scan API based on widget sensing method */
        #if (CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN)
            /* Check widget sensing method and call appropriate APIs */
            switch (CapSense_1_currentSenseMethod)
            {
                case CapSense_1_SENSE_METHOD_CSX_E:
                    CapSense_1_CSXScan();
                    break;

                case CapSense_1_SENSE_METHOD_CSD_E:
                     CapSense_1_CSDScan();
                    break;

                default:
                    scanStatus = CY_RET_UNKNOWN;
                    break;
            }

        /* If only CSD is enabled, call CSD scan */
        #elif (CapSense_1_ENABLE == CapSense_1_CSD_EN)
            CapSense_1_CSDScan();

        /* If only CSX is enabled, call CSX scan */
        #elif (CapSense_1_ENABLE == CapSense_1_CSX_EN)
            CapSense_1_CSXScan();

        #else
            scanStatus = CY_RET_UNKNOWN;
            #error "No sensing method enabled, Component cannot work in this mode"
        #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) */
    }

    return (scanStatus);
}


/*******************************************************************************
* Function Name: CapSense_1_ScanAllWidgets
****************************************************************************//**
*
* \brief
*  Initializes the first enabled widget and scanning of all the sensors in the
*  widget, then the same process is repeated for all the widgets in the Component,
*  i.e. scanning of all the widgets in the Component.
*
* \details
*  This function initializes a widget and scans all the sensors in the widget,
*  and then repeats the same for all the widgets in the Component. The tasks of
*  the CapSense_1_SetupWidget() and CapSense_1_Scan() functions are
*  executed by these functions. The status of a sensor scan must be checked
*  using the CapSense_1_IsBusy() API prior to starting a next scan
*  or setting up another widget.
*
* \return
*  Returns the status of the operation:
*    - CY_RET_SUCCESS - Scanning is successfully started.
*    - CY_RET_BAD_PARAM - All the widgets are disabled.
*    - CY_RET_INVALID_STATE - The previous scanning is not completed and the HW block is busy.
*    - CY_RET_UNKNOWN - There are unknown errors.
*
*******************************************************************************/
cy_status CapSense_1_ScanAllWidgets(void)
{
    cy_status scanStatus = CY_RET_UNKNOWN;

    uint32 wdgtIndex;

    if (CapSense_1_SW_STS_BUSY == (CapSense_1_dsRam.status & CapSense_1_SW_STS_BUSY))
    {
        /* Previous widget is being scanned. Return error. */
        scanStatus = CY_RET_INVALID_STATE;
    }
    else
    {
        /*
         *  Set up widget first widget.
         *  If widget returned error, set up next, continue same until widget does not return error.
         */
        for (wdgtIndex = 0u;
             wdgtIndex < CapSense_1_TOTAL_WIDGETS;
             wdgtIndex++)
        {

            scanStatus = CapSense_1_SetupWidget(wdgtIndex);

            if (CY_RET_SUCCESS == scanStatus)
            {
                #if (0u != (CapSense_1_TOTAL_WIDGETS - 1u))
                    /* If there are more than one widget to be scanned, request callback to scan next widget */
                    if ((CapSense_1_TOTAL_WIDGETS - 1u) > wdgtIndex)
                    {
                         /* Request callback to scan next widget in ISR */
                        CapSense_1_requestScanAllWidget = CapSense_1_ENABLE;
                    }
                    else
                    {
                        /* Request to exit in ISR (Do not scan the next widgets) */
                        CapSense_1_requestScanAllWidget = CapSense_1_DISABLE;
                    }
                #else
                    {
                        /* Request to exit in ISR (We have only one widget) */
                        CapSense_1_requestScanAllWidget = CapSense_1_DISABLE;
                    }
                #endif  /* (0u != (CapSense_1_TOTAL_WIDGETS - 1u)) */

                /* Initiate scan and quit loop */
                scanStatus = CapSense_1_Scan();

                break;
            }
        }
    }

    return (scanStatus);
}


