swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.c
/*******************************************************************************
* Function Name: CapSense_1_SsInitialize
****************************************************************************//**
*
* \brief
*  Performs hardware and firmware initialization required for proper operation
*  of the CapSense_1 Component. This function is called from
*  the CapSense_1_Start() API prior to calling any other APIs of the Component.
*
* \details
*  Performs hardware and firmware initialization required for proper operation
*  of the CapSense_1 Component. This function is called from
*  the CapSense_1_Start() API prior to calling any other APIs of the Component.
*  1. Depending on the configuration, the function initializes the CSD block
*     for the corresponding sensing mode.
*  2. The function updates the dsRam.wdgtWorking variable with 1 when Self-test
*     is enabled.
*
*  Calling the CapSense_1_Start API is the recommended method to initialize
*  the CapSense_1 Component at power-up. The CapSense_1_SsInitialize()
*  API should not be used for initialization, resume, or wake-up operations.
*  The dsRam.wdgtWorking variable is updated.
*
* \return status
*  Returns status of operation:
*  - Zero        - Indicates successful initialization.
*  - Non-zero    - One or more errors occurred in the initialization process.
*
*******************************************************************************/
cy_status CapSense_1_SsInitialize(void)
{
    cy_status initStatus = CY_RET_SUCCESS;

    #if((CapSense_1_ENABLE == CapSense_1_CSD_EN) ||\
        (CapSense_1_ENABLE == CapSense_1_CSX_EN))
        CapSense_1_SsInitializeSourceSenseClk();
    #endif /* ((CapSense_1_ENABLE == CapSense_1_CSD_EN) ||\
               (CapSense_1_ENABLE == CapSense_1_CSX_EN)) */

    /* Set all IO states to default state */
    CapSense_1_SsSetIOsInDefaultState();

    #if ((CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) || \
         (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN) || \
         (CapSense_1_ENABLE == CapSense_1_ADC_EN))
        /*
         * CSD hardware block is initialized in the Setup Widget based
         * on widget sensing method. Release previously captured HW resources
         * if it is second call of CapSense_1_Start() function.
         */
        CapSense_1_SsSwitchSensingMode(CapSense_1_UNDEFINED_E);
    #elif (CapSense_1_ENABLE == CapSense_1_CSD_EN)
        /* Initialize CSD block for CSD scanning */
        CapSense_1_SsCSDInitialize();

    #elif (CapSense_1_ENABLE == CapSense_1_CSX_EN)
        /* Initialize CSD block for CSX scanning */
        CapSense_1_CSXInitialize();

    #else
        #error "No sensing method enabled, Component cannot work in this mode"
        initStatus = CY_RET_UNKNOWN;
    #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) */

    return (initStatus);
}


/*******************************************************************************
* Function Name: CapSense_1_SetPinState
****************************************************************************//**
*
* \brief
*  Sets the state (drive mode and output state) of the port pin used by a sensor.
*  The possible states are GND, Shield, High-Z, Tx or Rx, Sensor. If the sensor
*  specified in the input parameter is a ganged sensor, then the state of all pins
*  associated with the ganged sensor is updated.
*
* \details
*  This function sets a specified state for a specified sensor element. For the
*  CSD widgets, sensor element is a sensor ID, for the CSX widgets, it is either
*  an Rx or Tx electrode ID. If the specified sensor is a ganged sensor, then
*  the specified state is set for all the electrodes belong to the sensor.
*  This function must not be called while the Component is in the busy state.
*
*  This function accepts the CapSense_1_SHIELD and
*  CapSense_1_SENSOR states as an input only if there is at least
*  one CSD widget. Similarly, this function accepts the CapSense_1_TX_PIN
*  and CapSense_1_RX_PIN states as an input only if there is at least
*  one CSX widget in the project.

*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the custom-specific
*  use cases. Functions that perform a setup and scan of a sensor/widget
*  automatically set the required pin states. They ignore changes
*  in the design made by the CapSense_1_SetPinState() function.
*  This function neither check wdgtIndex nor sensorElement for the correctness.
*
* \param widgetId
*  Specifies the ID of the widget to change the pin state of the specified
*  sensor.
*  A macro for the widget ID can be found in the CapSense_1 Configuration
*  header file defined as CapSense_1_<WidgetName>_WDGT_ID.
*
* \param sensorElement
*  Specifies the ID of the sensor element within the widget to change
*  its pin state.
*  For the CSD widgets, sensorElement is the sensor ID and can be found in the
*  CapSense_1 Configuration header file defined as
*  CapSense_1_<WidgetName>_SNS<SensorNumber>_ID.
*  For the CSX widgets, sensorElement is defined either as Rx ID or Tx ID.
*  The first Rx in a widget corresponds to sensorElement = 0, the second
*  Rx in a widget corresponds to sensorElement = 1, and so on.
*  The last Tx in a widget corresponds to sensorElement = (RxNum + TxNum).
*  Macros for Rx and Tx IDs can be found in the
*  CapSense_1 Configuration header file defined as:
*  - CapSense_1_<WidgetName>_RX<RXNumber>_ID
*  - CapSense_1_<WidgetName>_TX<TXNumber>_ID.
*
* \param state
*  Specifies the state of the sensor to be set:
*     1. CapSense_1_GROUND - The pin is connected to the ground.
*     2. CapSense_1_HIGHZ - The drive mode of the pin is set to High-Z
*        Analog.
*     3. CapSense_1_SHIELD - The shield signal is routed to the pin
*        (available only if CSD sensing method with shield electrode is enabled).
*     4. CapSense_1_SENSOR - The pin is connected to the scanning bus
*        (available only if CSD sensing method is enabled).
*     5. CapSense_1_TX_PIN - The Tx signal is routed to the sensor
*        (available only if CSX sensing method is enabled).
*     6. CapSense_1_RX_PIN - The pin is connected to the scanning bus
*        (available only if CSX sensing method is enabled).
*
*******************************************************************************/
void CapSense_1_SetPinState(uint32 widgetId, uint32 sensorElement, uint32 state)
{
    uint32 eltdNum;
    uint32 eltdIndex;
    uint32 interruptState;
    CapSense_1_FLASH_IO_STRUCT const *ioPtr;
    #if (CapSense_1_ENABLE == CapSense_1_GANGED_SNS_EN)
        CapSense_1_FLASH_SNS_STRUCT const *curFlashSnsPtr;
    #endif

    /* Getting sensor element pointer and number of electrodes */
    #if (CapSense_1_ENABLE == CapSense_1_GANGED_SNS_EN)
        /* Check the ganged sns flag */
        if (CapSense_1_GANGED_SNS_MASK == (CapSense_1_dsFlash.wdgtArray[widgetId].staticConfig & CapSense_1_GANGED_SNS_MASK))
        {
            curFlashSnsPtr = CapSense_1_dsFlash.wdgtArray[widgetId].ptr2SnsFlash;
            curFlashSnsPtr += sensorElement;
            ioPtr = &CapSense_1_ioList[curFlashSnsPtr->firstPinId];
            eltdNum = curFlashSnsPtr->numPins;
        }
        else
        {
            ioPtr = (CapSense_1_FLASH_IO_STRUCT const *)CapSense_1_dsFlash.wdgtArray[widgetId].ptr2SnsFlash + sensorElement;
            eltdNum = 1u;
        }
    #else
        ioPtr = (CapSense_1_FLASH_IO_STRUCT const *)CapSense_1_dsFlash.wdgtArray[widgetId].ptr2SnsFlash + sensorElement;
        eltdNum = 1u;
    #endif

