swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.c
    /* Loop through all electrodes of the specified sensor element */
    for (eltdIndex = 0u; eltdIndex < eltdNum; eltdIndex++)
    {
        /* Reset HSIOM and PC registers */
        interruptState = Cy_SysLib_EnterCriticalSection();
        Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber, (en_hsiom_sel_t)CapSense_1_HSIOM_SEL_GPIO);
        Cy_SysLib_ExitCriticalSection(interruptState);

        switch (state)
        {
        case CapSense_1_GROUND:
            interruptState = Cy_SysLib_EnterCriticalSection();
            Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF);
            Cy_GPIO_Clr((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber);
            Cy_SysLib_ExitCriticalSection(interruptState);
            break;

        case CapSense_1_HIGHZ:
            interruptState = Cy_SysLib_EnterCriticalSection();
            Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber, CY_GPIO_DM_ANALOG);
            Cy_GPIO_Clr((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber);
            Cy_SysLib_ExitCriticalSection(interruptState);
            break;

        #if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
            case CapSense_1_SENSOR:
                /* Enable sensor */
                CapSense_1_CSDConnectSns(ioPtr);
                break;

            #if (CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_EN)
                case CapSense_1_SHIELD:
                    interruptState = Cy_SysLib_EnterCriticalSection();
                    Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF);
                    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber, (en_hsiom_sel_t)CapSense_1_HSIOM_SEL_CSD_SHIELD);
                    Cy_SysLib_ExitCriticalSection(interruptState);
                    break;
            #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_EN) */
        #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_EN) */

        #if (CapSense_1_ENABLE == CapSense_1_CSX_EN)
            case CapSense_1_TX_PIN:
                interruptState = Cy_SysLib_EnterCriticalSection();
                Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber, (en_hsiom_sel_t)CapSense_1_HSIOM_SEL_CSD_SHIELD);
                Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF);
                Cy_SysLib_ExitCriticalSection(interruptState);
                break;

            case CapSense_1_RX_PIN:
                interruptState = Cy_SysLib_EnterCriticalSection();
                Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber, (en_hsiom_sel_t)CapSense_1_HSIOM_SEL_AMUXA);
                Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber, CY_GPIO_DM_ANALOG);
                Cy_SysLib_ExitCriticalSection(interruptState);
                break;
        #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_EN) */

        default:
            /* Wrong state */
            break;
        }

        ioPtr++;
    }
}


#if ((CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) || \
     (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN) || \
     (CapSense_1_ENABLE == CapSense_1_ADC_EN))

    #if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
        /*******************************************************************************
        * Function Name: CapSense_1_SsCSDDisableMode
        ****************************************************************************//**
        *
        * \brief
        *  This function disables CSD mode.
        *
        * \details
        *  To disable CSD mode the following tasks are performed:
        *  1. Disconnect Cmod from AMUXBUS-A.
        *  2. Disconnect previous CSX electrode if it has been connected.
        *  3. Disconnect Csh from AMUXBUS-B.
        *  4. Disable Shield Electrodes.
        *
        *******************************************************************************/
        static void CapSense_1_SsCSDDisableMode(void)
        {
            uint32 newRegValue = 0uL;

            /* To remove unreferenced local variable warning */
            (void)newRegValue;
            Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)CapSense_1_CSD_CMOD_PORT_PTR, CapSense_1_CSD_CMOD_PIN,
                                                                             (en_hsiom_sel_t)CapSense_1_HSIOM_SEL_GPIO);

            #if ((CapSense_1_ENABLE == CapSense_1_CSD_IDAC_COMP_EN) && \
                 (CapSense_1_ENABLE == CapSense_1_CSD_DEDICATED_IDAC_COMP_EN))
                /* Disconnect IDACA and IDACB */
                newRegValue = CY_GET_REG32(CapSense_1_CSD_SW_REFGEN_SEL_PTR);
                newRegValue &= (uint32)(~CapSense_1_CSD_SW_REFGEN_SEL_SW_IAIB_MSK);
                CY_SET_REG32(CapSense_1_CSD_SW_REFGEN_SEL_PTR, newRegValue);
            #endif /* ((CapSense_1_ENABLE == CapSense_1_CSD_IDAC_COMP_EN) && \
                       (CapSense_1_ENABLE == CapSense_1_CSD_DEDICATED_IDAC_COMP_EN)) */

            /* Disconnect previous CSD electrode if it has been connected */
            CapSense_1_SsCSDElectrodeCheck();

            /* Disconnect Csh from AMUXBUS-B */
            #if ((CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_EN) && \
                 (CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_TANK_EN))

                Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)CapSense_1_CSD_CTANK_PORT_PTR, CapSense_1_CSD_CTANK_PIN,
                                                           (en_hsiom_sel_t)CapSense_1_HSIOM_SEL_GPIO);

            #endif /* ((CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_EN) && \
                       (CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_TANK_EN)) */

            #if ((CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_EN) && \
                 (0u != CapSense_1_CSD_TOTAL_SHIELD_COUNT))
                CapSense_1_SsCSDDisableShieldElectrodes();
            #endif /* ((CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_EN) && \
                       (0u != CapSense_1_CSD_TOTAL_SHIELD_COUNT)) */
        }
    #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_EN) */


    #if (CapSense_1_ENABLE == CapSense_1_CSX_EN)
        /*******************************************************************************
        * Function Name: CapSense_1_SsDisableCSXMode
        ****************************************************************************//**
        *
        * \brief
        *  This function disables CSX mode.
        *
        * \details
        *  To disable CSX mode the following tasks are performed:
        *  1. Disconnect CintA and CintB from AMUXBUS-A.
        *  2. Disconnect previous CSX electrode if it has been connected.
        *
        *******************************************************************************/
        static void CapSense_1_SsDisableCSXMode(void)
        {
            /* Disconnect previous CSX electrode if it has been connected */
            CapSense_1_CSXElectrodeCheck();
        }
    #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_EN) */


