swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.c
    /*******************************************************************************
    * Function Name: CapSense_1_SsSwitchSensingMode
    ****************************************************************************//**
    *
    * \brief
    *  This function changes the mode for case when both CSD and CSX widgets are
    *  scanned.
    *
    * \details
    *  To switch to the CSD mode the following tasks are performed:
    *  1. Disconnect CintA and CintB from AMUXBUS-A.
    *  2. Disconnect previous CSD electrode if it has been connected.
    *  3. Initialize CSD mode.
    *
    *  To switch to the CSX mode the following tasks are performed:
    *  1. Disconnect Cmod from AMUXBUS-A.
    *  2. Disconnect previous CSX electrode if it has been connected.
    *  3. Initialize CSX mode.
    *
    * \param mode
    *  Specifies the scan mode:
    *  - CapSense_1_SENSE_METHOD_CSD_E
    *  - CapSense_1_SENSE_METHOD_CSX_E
    *  - CapSense_1_SENSE_METHOD_BIST_E
    *  - CapSense_1_UNDEFINED_E
    *
    *******************************************************************************/
    void CapSense_1_SsSwitchSensingMode(CapSense_1_SENSE_METHOD_ENUM mode)
    {
        if (CapSense_1_currentSenseMethod != mode)
        {
            /* The requested mode differes to the current one. Disable the current mode */
            if (CapSense_1_SENSE_METHOD_CSD_E == CapSense_1_currentSenseMethod)
            {
                #if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
                    CapSense_1_SsCSDDisableMode();
                #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_EN) */
            }
            else if (CapSense_1_SENSE_METHOD_CSX_E == CapSense_1_currentSenseMethod)
            {
                #if (CapSense_1_ENABLE == CapSense_1_CSX_EN)
                    CapSense_1_SsDisableCSXMode();
                #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_EN) */
            }
            else if (CapSense_1_SENSE_METHOD_BIST_E == CapSense_1_currentSenseMethod)
            {
                #if (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN)
                    CapSense_1_BistDisableMode();
                #endif /* (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN) */
            }
            else
            {
                #if (CapSense_1_ENABLE == CapSense_1_ADC_EN)
                    /* Release ADC resources */
                    (void)CapSense_1_AdcReleaseResources();
                #endif /* (CapSense_1_ENABLE == CapSense_1_ADC_EN) */
            }

            /* Enable the specified mode */
            if (CapSense_1_SENSE_METHOD_CSD_E == mode)
            {
                #if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
                    /* Initialize CSD mode to guarantee configured CSD mode */
                    CapSense_1_SsCSDInitialize();
                    CapSense_1_currentSenseMethod = CapSense_1_SENSE_METHOD_CSD_E;
                #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_EN) */
            }
            else if (CapSense_1_SENSE_METHOD_CSX_E == mode)
            {
                #if (CapSense_1_ENABLE == CapSense_1_CSX_EN)
                    /* Initialize CSX mode to guarantee configured CSX mode */
                    CapSense_1_CSXInitialize();
                    CapSense_1_currentSenseMethod = CapSense_1_SENSE_METHOD_CSX_E;
                #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_EN) */
            }
            else if (CapSense_1_SENSE_METHOD_BIST_E == mode)
            {
                #if (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN)
                    CapSense_1_BistInitialize();
                    CapSense_1_currentSenseMethod = CapSense_1_SENSE_METHOD_BIST_E;
                #endif /* (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN) */
            }
            else
            {
                CapSense_1_currentSenseMethod = CapSense_1_UNDEFINED_E;
            }
        }
    }
#endif  /* ((CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) || \
            (CapSense_1_ENABLE == CapSense_1_ADC_EN)) */


/*******************************************************************************
* Function Name: CapSense_1_SsSetIOsInDefaultState
****************************************************************************//**
*
* \brief
*  Sets all electrodes into a default state.
*
* \details
*  Sets all the CSD/CSX IOs into a default state:
*  - HSIOM   - Disconnected, the GPIO mode.
*  - DM      - Strong drive.
*  - State   - Zero.
*
*  Sets all the ADC channels into a default state:
*  - HSIOM   - Disconnected, the GPIO mode.
*  - DM      - HiZ-Analog.
*  - State   - Zero.
*
*  It is not recommended to call this function directly from the application
*  layer.
*
*******************************************************************************/
void CapSense_1_SsSetIOsInDefaultState(void)
{
    CapSense_1_FLASH_IO_STRUCT const *ioPtr = &CapSense_1_ioList[0u];
    uint32 loopIndex;

    /* Loop through all electrodes */
    for (loopIndex = 0u; loopIndex < CapSense_1_TOTAL_ELECTRODES; loopIndex++)
    {
        /*
        *   1. Disconnect HSIOM
        *   2. Set strong DM
        *   3. Set pin state to logic 0
        */
        Cy_GPIO_Pin_FastInit((GPIO_PRT_Type*)ioPtr->pcPtr, (uint32)ioPtr->pinNumber, CY_GPIO_DM_STRONG, 0u,
                                                        (en_hsiom_sel_t)CapSense_1_HSIOM_SEL_GPIO);

        /* Get next electrode */
        ioPtr++;
    }

    #if(CapSense_1_ENABLE == CapSense_1_ADC_EN)
        CapSense_1_ClearAdcChannels();
    #endif /* (CapSense_1_ENABLE == CapSense_1_ADC_EN) */
}

#if (CapSense_1_ENABLE == CapSense_1_ADC_EN)
/*******************************************************************************
* Function Name: CapSense_1_SsReleaseResources()
****************************************************************************//**
*
* \brief
*  This function sets the resources that do not belong to the sensing HW block to
*  default state.
*
* \details
*  The function performs following tasks:
*  1. Checks if CSD block busy and returns error if it is busy
*  2. Disconnects integration capacitors (CintA, CintB for CSX mode and
*     Cmod for CSD mode)
*  3. Disconnect electroded if they have been connected.
*
* \return
*  Returns the status of the operation:
*  - Zero        - Resources released successfully.
*  - Non-zero    - One or more errors occurred in releasing process.
*
*******************************************************************************/
cy_status CapSense_1_SsReleaseResources(void)
{
    cy_status busyStatus = CY_RET_SUCCESS;

