swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.c
    if (CapSense_1_SW_STS_BUSY == (CapSense_1_dsRam.status & CapSense_1_SW_STS_BUSY))
    {
        /* Previous widget is being scanned. Return error. */
        busyStatus = CY_RET_INVALID_STATE;
    }
    else
    {
        #if (CapSense_1_ENABLE == CapSense_1_CSX_EN)
            CapSense_1_SsDisableCSXMode();
        #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_EN) */

        #if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
            CapSense_1_SsCSDDisableMode();
        #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_EN) */

        #if (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN)
            CapSense_1_BistDisableMode();
        #endif /* (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN) */

        #if ((CapSense_1_ENABLE == CapSense_1_CSD_EN) && \
             (CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_EN) &&  \
             (CapSense_1_SNS_CONNECTION_SHIELD == CapSense_1_CSD_INACTIVE_SNS_CONNECTION))
            CapSense_1_SsSetIOsInDefaultState();
        #endif /* ((CapSense_1_ENABLE == CapSense_1_CSD_EN) && \
             (CapSense_1_DISABLE != CapSense_1_CSD_SHIELD_EN) &&  \
             (CapSense_1_SNS_CONNECTION_SHIELD == CapSense_1_CSD_INACTIVE_SNS_CONNECTION)) */

        /*
         * Reset of the currentSenseMethod variable to make sure that the next
         * call of SetupWidget() API setups the correct widget mode
         */
        CapSense_1_currentSenseMethod = CapSense_1_UNDEFINED_E;
    }

    return busyStatus;
}
#endif /* (CapSense_1_ENABLE == CapSense_1_ADC_EN) */


/*******************************************************************************
* Function Name: CapSense_1_SsPostAllWidgetsScan
****************************************************************************//**
*
* \brief
*  The ISR function for multiple widget scanning implementation.
*
* \details
*  This is the function used by the CapSense_1 ISR to implement multiple widget
*  scanning.
*  Should not be used by the application layer.
*
*******************************************************************************/
void CapSense_1_SsPostAllWidgetsScan(void)
{
    /*
    *   1. Increment widget index
    *   2. Check if all the widgets are scanned
    *   3. If all the widgets are not scanned, set up and scan next widget
    */
    #if (1u != CapSense_1_TOTAL_WIDGETS)
        cy_status postScanStatus;

        do
        {
            CapSense_1_widgetIndex++;

            postScanStatus = CapSense_1_SetupWidget((uint32)CapSense_1_widgetIndex);

            if (CY_RET_SUCCESS == postScanStatus)
            {
                if((CapSense_1_TOTAL_WIDGETS - 1u) == CapSense_1_widgetIndex)
                {
                    /* The last widget will be scanned. Reset flag to skip configuring the next widget setup in ISR. */
                    CapSense_1_requestScanAllWidget = CapSense_1_DISABLE;
                }
                (void)CapSense_1_Scan();
            }
            else if((CapSense_1_TOTAL_WIDGETS - 1u) == CapSense_1_widgetIndex)
            {
                #if ((CapSense_1_ENABLE == CapSense_1_BLOCK_OFF_AFTER_SCAN_EN) && \
                     (CapSense_1_ENABLE == CapSense_1_CSD_EN))
                    if (CapSense_1_SENSE_METHOD_CSD_E ==
                        CapSense_1_GET_SENSE_METHOD(&CapSense_1_dsFlash.wdgtArray[CapSense_1_widgetIndex]))
                    {
                        /* Disable the CSD block */
                        CY_SET_REG32(CapSense_1_CSD_CONFIG_PTR, CapSense_1_configCsd);
                    }
                #endif /* ((CapSense_1_ENABLE == CapSense_1_BLOCK_OFF_AFTER_SCAN_EN) && \
                           (CapSense_1_ENABLE == CapSense_1_CSD_EN)) */

                /* Update scan Counter */
                CapSense_1_dsRam.scanCounter++;
                /* all the widgets are totally processed. Reset BUSY flag */
                CapSense_1_ClrBusyFlags(CapSense_1_SW_STS_BUSY);

                /* Update status with with the failure */
                CapSense_1_dsRam.status &= ~CapSense_1_STATUS_ERR_MASK;
                CapSense_1_dsRam.status |= ((postScanStatus & CapSense_1_STATUS_ERR_SIZE) << CapSense_1_STATUS_ERR_SHIFT);

                /* Set postScanStatus to exit the while loop */
                postScanStatus = CY_RET_SUCCESS;
            }
            else
            {
                /* Update status with with the failure. Configure the next widget in while() loop */
                CapSense_1_dsRam.status &= ~CapSense_1_STATUS_ERR_MASK;
                CapSense_1_dsRam.status |= ((postScanStatus & CapSense_1_STATUS_ERR_SIZE) << CapSense_1_STATUS_ERR_SHIFT);
            }
        } while (CY_RET_SUCCESS != postScanStatus);
    #endif /* (1u != CapSense_1_TOTAL_WIDGETS) */
}


/*******************************************************************************
* Function Name: CapSense_1_SsIsrInitialize
****************************************************************************//**
*
* \brief
*  Enables and initializes for the function pointer for a callback for the ISR.
*
* \details
*  The "address" is a special type cy_israddress defined by syslib. This function
*  is used by Component APIs and should not be used by an application program for
*  proper working of the Component.
*
* \param address
*  The address of the function to be called when interrupt is fired.
*
*******************************************************************************/
void CapSense_1_SsIsrInitialize(cy_israddress address)
{
    /* Disable interrupt */
    #if defined(CapSense_1_ISR__INTC_ASSIGNED)
        NVIC_DisableIRQ(CapSense_1_ISR_cfg.intrSrc);
    #endif

    /* Configure interrupt with priority and vector */
    #if defined(CapSense_1_ISR__INTC_ASSIGNED)
        (void)Cy_SysInt_Init(&CapSense_1_ISR_cfg, address);
    #endif

    /* Enable interrupt */
    #if defined(CapSense_1_ISR__INTC_ASSIGNED)
        NVIC_EnableIRQ(CapSense_1_ISR_cfg.intrSrc);
    #endif
}


/*******************************************************************************
* Function Name: CapSense_1_SsSetSnsFirstPhaseWidth
****************************************************************************//**
*
* \brief
*  Defines the length of the first phase of the sense clock in clk_csd cycles.
*
* \details
*  It is not recommended to call this function directly by the application layer.
*  It is used by initialization, widget APIs or wakeup functions to
*  enable the clocks.
*  At all times it must be assured that the phases are at least 2 clk_csd cycles
*  (1 for non overlap, if used), if this rule is violated the result is undefined.
*
* \param
*  snsClk The divider value for the sense clock.
*
*******************************************************************************/
void CapSense_1_SsSetSnsFirstPhaseWidth(uint32 phaseWidth)
{
    uint32 newRegValue;

    newRegValue = CY_GET_REG32(CapSense_1_CSD_SENSE_DUTY_PTR);
    newRegValue &= (uint32)(~CapSense_1_CSD_SENSE_DUTY_SENSE_WIDTH_MSK);
    newRegValue |= phaseWidth;
    CY_SET_REG32(CapSense_1_CSD_SENSE_DUTY_PTR, newRegValue);
}


