swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.c
        #if (CapSense_1_CSD_MATRIX_WIDGET_EN || CapSense_1_CSD_TOUCHPAD_WIDGET_EN)
            if ((CapSense_1_WD_TOUCHPAD_E == (CapSense_1_WD_TYPE_ENUM)CapSense_1_dsFlash.wdgtArray[wdgtIndex].wdgtType) ||
                (CapSense_1_WD_MATRIX_BUTTON_E == (CapSense_1_WD_TYPE_ENUM)CapSense_1_dsFlash.wdgtArray[wdgtIndex].wdgtType))
            {
                #if(CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSD_SNS_CLK_SOURCE)
                    snsClkDivider = CapSense_1_SsCSDGetRowSnsClkDivider(wdgtIndex);

                        lfsrSize = CapSense_1_SsCalcLfsrSize(snsClkDivider, conversionsNum);
                        if (CapSense_1_CLK_SOURCE_DIRECT == lfsrSize)
                        {
                            lfsrSize = CapSense_1_SsCSDCalcPrsSize(snsClkDivider << 1uL, (uint32)ptrWdgt->resolution);
                        }
                        lfsrScale = CapSense_1_SsCalcLfsrScale(snsClkDivider, lfsrSize);

                        if((lfsrSize == CapSense_1_CLK_SOURCE_PRS8) || (lfsrSize == CapSense_1_CLK_SOURCE_PRS12))
                        {
                            CapSense_1_SsCSDSetRowSnsClkDivider(wdgtIndex, snsClkDivider);
                        }
                #else
                    lfsrSize = (uint8)CapSense_1_DEFAULT_MODULATION_MODE;
                    lfsrScale = 0u;
                #endif /* (CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSD_SNS_CLK_SOURCE) */
                ptrWdgt->rowSnsClkSource = lfsrSize | (uint8)(lfsrScale << CapSense_1_CLK_SOURCE_LFSR_SCALE_OFFSET);
            }
        #endif /* (CapSense_1_CSD_MATRIX_WIDGET_EN || CapSense_1_CSD_TOUCHPAD_WIDGET_EN) */
    }
#endif /* (CapSense_1_ENABLE == CapSense_1_CSD_EN) */


#if (CapSense_1_ENABLE == CapSense_1_CSX_EN)
    /*******************************************************************************
    * Function Name: CapSense_1_SsSetWidgetTxClkSrc
    ****************************************************************************//**
    *
    * \brief
    *  Sets a source for the Tx clock for a widget.
    *
    * \param wdgtIndex
    *  Specifies the ID of the widget.
    * \param ptrWdgt
    *  The pointer to the RAM_WD_BASE_STRUCT structure.
    *
    * \details
    *  Updates snsClkSource with with a source for Tx Clk for a widget.
    *
    *******************************************************************************/
    __STATIC_INLINE void CapSense_1_SsSetWidgetTxClkSrc(uint32 wdgtIndex, CapSense_1_RAM_WD_BASE_STRUCT * ptrWdgt)
    {
        uint8 lfsrSize;
        uint8 lfsrScale;

        #if ((CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSX_TX_CLK_SOURCE) && \
             (CapSense_1_DISABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES))
            uint32 conversionsNum;
            uint32 snsClkDivider;
        #endif

        #if(CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSX_TX_CLK_SOURCE)
            #if (CapSense_1_DISABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
                conversionsNum = (uint32)ptrWdgt->resolution;
                snsClkDivider = CapSense_1_SsCSXGetTxClkDivider(wdgtIndex);
                lfsrSize = CapSense_1_SsCalcLfsrSize(snsClkDivider, conversionsNum);
                lfsrScale = CapSense_1_SsCalcLfsrScale(snsClkDivider, lfsrSize);
            #else
                lfsrSize = (uint8)CapSense_1_CLK_SOURCE_DIRECT;
                lfsrScale = 0u;
                /* Unused function argument */
                (void)wdgtIndex;
            #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */
        #else
            lfsrSize = (uint8)CapSense_1_CSX_TX_CLK_SOURCE;
            lfsrScale = 0u;
            /* Unused function argument */
            (void)wdgtIndex;
        #endif /* (CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSX_TX_CLK_SOURCE) */

        ptrWdgt->snsClkSource = lfsrSize | (uint8)(lfsrScale << CapSense_1_CLK_SOURCE_LFSR_SCALE_OFFSET);
    }
#endif /* (CapSense_1_ENABLE == CapSense_1_CSX_EN) */


#if(((CapSense_1_ENABLE == CapSense_1_CSX_EN) && \
     (CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSX_TX_CLK_SOURCE) && \
     (CapSense_1_DISABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)) ||\
    ((CapSense_1_ENABLE == CapSense_1_CSD_EN) && \
     (CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSD_SNS_CLK_SOURCE)))
/*******************************************************************************
* Function Name: CapSense_1_SsCalcLfsrSize
****************************************************************************//**
*
* \brief
*  This is an internal function that finds a SSC polynomial size in the Auto mode.
*
* \details
*  The SSC polynomial size in the auto mode is found based on the following
*  requirements:
*  - an LFSR value should be selected so that the max clock dither is limited with +/-10%.
*  - at least one full spread spectrum polynomial should pass during the scan time.
*  - the value of the number of conversions should be an integer multiple of the
*    repeat period of the programmed LFSR_SIZE.
*
* \param
*  snsClkDivider The divider value for the sense clock.
*  resolution The widget resolution.
*
* \return lfsrSize The LFSRSIZE value for the SENSE_PERIOD register.
*
*******************************************************************************/
static uint8 CapSense_1_SsCalcLfsrSize(uint32 snsClkDivider, uint32 conversionsNum)
{
    uint8 lfsrSize = 0u;

    /* Find LFSR value */
    if((CapSense_1_SNSCLK_SSC4_THRESHOLD <= snsClkDivider) &&
       (CapSense_1_SNSCLK_SSC4_PERIOD <= conversionsNum) &&
       (0uL == (conversionsNum % CapSense_1_SNSCLK_SSC4_PERIOD)))
    {
        lfsrSize = CapSense_1_CLK_SOURCE_SSC4;
    }
    else if((CapSense_1_SNSCLK_SSC3_THRESHOLD <= snsClkDivider) &&
            (CapSense_1_SNSCLK_SSC3_PERIOD <= conversionsNum) &&
            (0uL == (conversionsNum % CapSense_1_SNSCLK_SSC3_PERIOD)))
    {
        lfsrSize = CapSense_1_CLK_SOURCE_SSC3;
    }
    else if((CapSense_1_SNSCLK_SSC2_THRESHOLD <= snsClkDivider) &&
            (CapSense_1_SNSCLK_SSC2_PERIOD <= conversionsNum) &&
            (0uL == (conversionsNum % CapSense_1_SNSCLK_SSC2_PERIOD)))
    {
        lfsrSize = CapSense_1_CLK_SOURCE_SSC2;
    }
    else if((CapSense_1_SNSCLK_SSC1_THRESHOLD <= snsClkDivider) &&
            (CapSense_1_SNSCLK_SSC1_PERIOD <= conversionsNum) &&
            (0uL == (conversionsNum % CapSense_1_SNSCLK_SSC1_PERIOD)))
    {
        lfsrSize = CapSense_1_CLK_SOURCE_SSC1;
    }
    else
    {
        lfsrSize = (uint8)CapSense_1_CLK_SOURCE_DIRECT;
    }

    return (lfsrSize);
}


