swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.c
/*******************************************************************************
* Function Name: CapSense_1_SsCalcLfsrScale
****************************************************************************//**
*
* \brief
*  This is an internal function that calculates the LFSR scale value.
*
* \details
*  The LFSR scale value is used to increase the clock dither if the desired dither
*  is wider than can be achieved with the current Sense Clock Divider and current LFSR
*  period.
*
*  This returns the LFSR scale value needed to keep the clock dither in
*  range +/-10%.
*
* \param
*  snsClkDivider The divider value for the sense clock.
*  lfsrSize The period of the LFSR sequence.
*          CapSense_1_CLK_SOURCE_DIRECT The spreadspectrum is not used.
*          CapSense_1_CLK_SOURCE_SSC1   The length of LFSR sequence is 63 cycles.
*          CapSense_1_CLK_SOURCE_SSC2   The length of LFSR sequence is 127 cycles.
*          CapSense_1_CLK_SOURCE_SSC3   The length of LFSR sequence is 255 cycles.
*          CapSense_1_CLK_SOURCE_SSC4   The length of LFSR sequence is 511 cycles.
*
* \return The LFSR scale value needed to keep the clock dither in range +/-10%.
*
*******************************************************************************/
static uint8 CapSense_1_SsCalcLfsrScale(uint32 snsClkDivider, uint8 lfsrSize)
{
    uint32 lfsrScale;
    uint32 lfsrRange;
    uint32 lfsrDither;

    /* Initialize the lfsrSize variable with the LFSR Range for given Lfsr Size. */
    switch(lfsrSize)
    {
        case CapSense_1_CLK_SOURCE_SSC1:
        {
            lfsrRange = CapSense_1_SNSCLK_SSC1_RANGE;
            break;
        }
        case CapSense_1_CLK_SOURCE_SSC2:
        {
            lfsrRange = CapSense_1_SNSCLK_SSC2_RANGE;
            break;
        }
        case CapSense_1_CLK_SOURCE_SSC3:
        {
            lfsrRange = CapSense_1_SNSCLK_SSC3_RANGE;
            break;
        }
        case CapSense_1_CLK_SOURCE_SSC4:
        {
            lfsrRange = CapSense_1_SNSCLK_SSC4_RANGE;
            break;
        }
        default:
        {
            lfsrRange = 0u;
            break;
        }
    }

    /* Calculate the LFSR Scale value that is required to keep the Clock dither
     * as close as possible to the +/-10% limit of the used frequency.
     */
    if((lfsrSize != CapSense_1_CLK_SOURCE_DIRECT) && (0u != lfsrRange))
    {
        /* Calculate the LFSR Dither in percents. */
        lfsrDither  = ((lfsrRange * 100uL) / snsClkDivider);
        lfsrScale = 0uL;

        while(lfsrDither < CapSense_1_LFSR_DITHER_PERCENTAGE)
        {
            lfsrScale++;
            lfsrDither <<=1uL;
        }

        if(lfsrDither > CapSense_1_LFSR_DITHER_PERCENTAGE)
        {
            lfsrScale--;
        }
    }
    else
    {
        lfsrScale = 0uL;
    }

    return ((uint8)lfsrScale);
}

#endif /* (((CapSense_1_ENABLE == CapSense_1_CSX_EN) && \
            (CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSX_TX_CLK_SOURCE) && \
            (CapSense_1_DISABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)) ||\
           ((CapSense_1_ENABLE == CapSense_1_CSD_EN) && \
            (CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSD_SNS_CLK_SOURCE))) */


#if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
    /*******************************************************************************
    * Function Name: CapSense_1_SsClearCSDSensors
    ****************************************************************************//**
    *
    * \brief
    *  Resets all the CSD sensors to the non-sampling state by sequentially
    *  disconnecting all the sensors from the Analog MUX bus and putting them to
    *  an inactive state.
    *
    * \details
    *  The function goes through all the widgets and updates appropriate bits in
    *  the IO HSIOM, PC and DR registers depending on the Inactive sensor connection
    *  parameter. DR register bits are set to zero when the Inactive sensor
    *  connection is Ground or Hi-Z.
    *
    *******************************************************************************/
    void CapSense_1_SsClearCSDSensors(void)
    {
        uint32 wdgtIndex;
        uint32 snsIndex;

        #if (CapSense_1_ENABLE == CapSense_1_CSD_GANGED_SNS_EN)
            uint32 pinIndex;
        #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_GANGED_SNS_EN) */

        #if (CapSense_1_ENABLE == CapSense_1_CSD_GANGED_SNS_EN)
            /* Declare ptr to sensor IO structure */
            CapSense_1_FLASH_IO_STRUCT const *curDedicatedSnsIOPtr;
            /* Pointer to Flash structure holding info of sensor to be scanned */
            CapSense_1_FLASH_SNS_STRUCT const *curFlashSnsPtr;
        #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_GANGED_SNS_EN) */
        CapSense_1_FLASH_IO_STRUCT const *curSnsIOPtr;

        for (wdgtIndex = 0u; wdgtIndex < CapSense_1_TOTAL_WIDGETS; wdgtIndex++)
        {
            if (CapSense_1_SENSE_METHOD_CSD_E ==
                CapSense_1_GET_SENSE_METHOD(&CapSense_1_dsFlash.wdgtArray[wdgtIndex]))
            {
                curSnsIOPtr = (CapSense_1_FLASH_IO_STRUCT const *)
                                                CapSense_1_dsFlash.wdgtArray[wdgtIndex].ptr2SnsFlash;

                /* Go through all the sensors in widget */
                for (snsIndex = 0u; snsIndex < (uint8)CapSense_1_dsFlash.wdgtArray[wdgtIndex].totalNumSns; snsIndex++)
                {
                    #if (CapSense_1_ENABLE == CapSense_1_CSD_GANGED_SNS_EN)
                        /* Check ganged sns flag */
                        if (CapSense_1_GANGED_SNS_MASK == (CapSense_1_dsFlash.wdgtArray[wdgtIndex].staticConfig &
                                                                 CapSense_1_GANGED_SNS_MASK))
                        {
                            /* Get sns pointer */
                            curFlashSnsPtr = (CapSense_1_FLASH_SNS_STRUCT const *)
                                                               CapSense_1_dsFlash.wdgtArray[wdgtIndex].ptr2SnsFlash +
                                                               snsIndex;

                            for(pinIndex = 0u; pinIndex < curFlashSnsPtr->numPins; pinIndex++)
                            {
                                /* Get IO pointer for dedicated pin */
                                curDedicatedSnsIOPtr = &CapSense_1_ioList[curFlashSnsPtr->firstPinId + pinIndex];

                                /* Disconnect dedicated pin */
                                CapSense_1_CSDDisconnectSns(curDedicatedSnsIOPtr);
                            }
                        }
                        else
                        {
                            /* Disable sensor */
                            CapSense_1_CSDDisconnectSns(&curSnsIOPtr[snsIndex]);
                        }
                    #else
                        /* Disable sensor */
                        CapSense_1_CSDDisconnectSns(&curSnsIOPtr[snsIndex]);
                    #endif /* (CapSense_1_ENABLE == CapSense_1_CSD_GANGED_SNS_EN) */
                }
            }
        }
    }

