swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.c
/*******************************************************************************
* Function Name: CapSense_1_BistDischargeExtCapacitors
****************************************************************************//**
*
* \brief
*  The function discharge available external capacitors.
*
* \details
*  The function discharge available external capacitors by connection them
*  to GND using STRONG GPIO drive mode. Additionaly, the function disconnects
*  the capacitors from analog mux buses if connected.
*  Note: the function does not restore the connection to analog mux busses
*  and supposes that all the capacitors belong to a single device port.
*
*******************************************************************************/
void CapSense_1_BistDischargeExtCapacitors(void)
{
    #if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
        Cy_GPIO_SetHSIOM(CapSense_1_Cmod_0_PORT, CapSense_1_Cmod_0_NUM, HSIOM_SEL_GPIO);
        Cy_GPIO_Clr(CapSense_1_Cmod_0_PORT, CapSense_1_Cmod_0_NUM);
        Cy_GPIO_SetDrivemode(CapSense_1_Cmod_0_PORT, CapSense_1_Cmod_0_NUM, CY_GPIO_DM_STRONG_IN_OFF);

        #if((CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_EN) && \
            (CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_TANK_EN))
            Cy_GPIO_SetHSIOM(CapSense_1_Csh_0_PORT, CapSense_1_Csh_0_NUM, HSIOM_SEL_GPIO);
            Cy_GPIO_Clr(CapSense_1_Csh_0_PORT, CapSense_1_Csh_0_NUM);
            Cy_GPIO_SetDrivemode(CapSense_1_Csh_0_PORT, CapSense_1_Csh_0_NUM, CY_GPIO_DM_STRONG_IN_OFF);
        #endif
    #endif

    #if (CapSense_1_ENABLE == CapSense_1_CSX_EN)
        Cy_GPIO_SetHSIOM(CapSense_1_CintA_0_PORT, CapSense_1_CintA_0_NUM, HSIOM_SEL_GPIO);
        Cy_GPIO_Clr(CapSense_1_CintA_0_PORT, CapSense_1_CintA_0_NUM);
        Cy_GPIO_SetDrivemode(CapSense_1_CintA_0_PORT, CapSense_1_CintA_0_NUM, CY_GPIO_DM_STRONG_IN_OFF);

        Cy_GPIO_SetHSIOM(CapSense_1_CintB_0_PORT, CapSense_1_CintB_0_NUM, HSIOM_SEL_GPIO);
        Cy_GPIO_Clr(CapSense_1_CintB_0_PORT, CapSense_1_CintB_0_NUM);
        Cy_GPIO_SetDrivemode(CapSense_1_CintB_0_PORT, CapSense_1_CintB_0_NUM, CY_GPIO_DM_STRONG_IN_OFF);
    #endif

    Cy_SysLib_DelayUs(CapSense_1_EXT_CAP_DISCHARGE_TIME);

    #if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
        Cy_GPIO_SetDrivemode(CapSense_1_Cmod_0_PORT, CapSense_1_Cmod_0_NUM, CY_GPIO_DM_ANALOG);

        #if((CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_EN) && \
            (CapSense_1_ENABLE == CapSense_1_CSD_SHIELD_TANK_EN))
            Cy_GPIO_SetDrivemode(CapSense_1_Csh_0_PORT, CapSense_1_Csh_0_NUM, CY_GPIO_DM_ANALOG);
        #endif
    #endif

    #if (CapSense_1_ENABLE == CapSense_1_CSX_EN)
        Cy_GPIO_SetDrivemode(CapSense_1_CintA_0_PORT, CapSense_1_CintA_0_NUM, CY_GPIO_DM_ANALOG);
        Cy_GPIO_SetDrivemode(CapSense_1_CintB_0_PORT, CapSense_1_CintB_0_NUM, CY_GPIO_DM_ANALOG);
    #endif
}


/* [] END OF FILE */
